docs/CS/MachineLearning/interview.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-09-25 Tue 11:23 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="weiwu" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">逻辑斯特回归为什么要对特征进行离散化</a></li>
<li><a href="#orgheadline5">多重共线性</a>
<ul>
<li><a href="#orgheadline2">什么是多重共线性？</a></li>
<li><a href="#orgheadline3">要度量多重共线性，</a></li>
<li><a href="#orgheadline4">多重共线性的纠正方法</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">逻辑斯特回归为什么要对特征进行离散化</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
  @严林，本题解析来源：<a href="https://www.zhihu.com/question/31989952">https://www.zhihu.com/question/31989952</a>
</p>

<p>
  在工业界，很少直接将连续值作为逻辑回归模型的特征输入，而是将连续特征离散化为一系列0、1特征交给逻辑回归模型，这样做的优势有以下几点：
</p>

<p>
  0. 离散特征的增加和减少都很容易，易于模型的快速迭代；
</p>

<p>
  1. 稀疏向量内积乘法运算速度快，计算结果方便存储，容易扩展；
</p>

<p>
  2. 离散化后的特征对异常数据有很强的鲁棒性：比如一个特征是年龄&gt;30是1，否则0。如果特征没有离散化，一个异常数据“年龄300岁”会给模型造成很大的干扰；
</p>

<p>
  3. 逻辑回归属于广义线性模型，表达能力受限；单变量离散化为N个后，每个变量有单独的权重，相当于为模型引入了非线性，能够提升模型表达能力，加大拟合；
</p>

<p>
  4. 离散化后可以进行特征交叉，由M+N个变量变为M*N个变量，进一步引入非线性，提升表达能力；
</p>

<p>
  5. 特征离散化后，模型会更稳定，比如如果对用户年龄离散化，20-30作为一个区间，不会因为一个用户年龄长了一岁就变成一个完全不同的人。当然处于区间相邻处的样本会刚好相反，所以怎么划分区间是门学问；
</p>

<p>
  6. 特征离散化以后，起到了简化了逻辑回归模型的作用，降低了模型过拟合的风险。
</p>

<p>
  李沐曾经说过：模型是使用离散特征还是连续特征，其实是一个“海量离散特征+简单模型” 同 “少量连续特征+复杂模型”的权衡。既可以离散化用线性模型，也可以用连续特征加深度学习。就看是喜欢折腾特征还是折腾模型了。通常来说，前者容易，而且可以n个人一起并行做，有成功经验；后者目前看很赞，能走多远还须拭目以待。
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5">多重共线性</h2>
<div class="outline-text-2" id="text-orgheadline5">
</div><div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">什么是多重共线性？</h3>
<div class="outline-text-3" id="text-orgheadline2">
<p>
回归中的多重共线性是一个当模型中一些预测变量与其他预测变量相关时发生的条件。严重的多重共线性可能会产生问题，因为它可以增大回归系数的方差，使它们变得不稳定。以下是不稳定系数导致的一些后果：
即使预测变量和响应之间存在显著关系，系数也可能看起来并不显著。
高度相关的预测变量的系数在样本之间差异很大。
从模型中去除任何高度相关的项都将大幅影响其他高度相关项的估计系数。高度相关项的系数甚至会包含错误的符号。
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">要度量多重共线性，</h3>
<div class="outline-text-3" id="text-orgheadline3">
<p>
可以检查预测变量的相关性结构。您也可以查看方差膨胀因子 (VIF)。VIF 用于在您的预测变量相关时，度量估计回归系数的方差增加的幅度。如果所有 VIF 都为 1，则不存在多重共线性，但如果有些 VIF 大于 1，则预测变量为相关。VIF 大于 5 时，该项的回归系数的估计结果不理想。
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">多重共线性的纠正方法</h3>
<div class="outline-text-3" id="text-orgheadline4">
<p>
如果要对多项式进行拟合，请将预测变量值减去预测变量的均值。
</p>

<ul class="org-ul">
<li>从模型中删除那些高度相关的预测变量。由于它们提供了冗余信息，因此删除它们通常不会显著减少 R2。</li>

<li>Stepwise Regression</li>
</ul>
<p>
考虑使用逐步回归、最佳子集回归或数据集的专门知识来删除这些变量。
</p>

<ul class="org-ul">
<li>使用偏最小二乘或主成分分析。这些方法可以将预测变量的数量减少为更小的不相关分量集。</li>
<li>增加样本容量</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
